In [2]:
pip install pandas

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x100ff5790>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x1026022a0>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x102f00920>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=1, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x102f00fe0>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=0, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x102f011f0>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
ERROR: Could not find a version that satisfies the requirement pandas (from versions: none)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: pip3 install --upgrade pip
ERROR: No matching distribution found for pandas
Note: you may need to restart the kernel to use updated packages.

In [3]:
pip install --upgrade pandas

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x1037fb5c0>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x10433baa0>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x104374fb0>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=1, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x104374d40>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=0, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x1043753d0>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
ERROR: Could not find a version that satisfies the requirement pandas (from versions: none)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: pip3 install --upgrade pip
ERROR: No matching distribution found for pandas
Note: you may need to restart the kernel to use updated packages.

In [3]:
!pip3 install pandas

WARNING: Retrying (Retry(total=4, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x1042f1bb0>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=3, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x1047109b0>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=2, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x104743080>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=1, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x1048c1ca0>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
WARNING: Retrying (Retry(total=0, connect=None, read=None, redirect=None, status=None)) after connection broken by 'NewConnectionError('<pip._vendor.urllib3.connection.HTTPSConnection object at 0x1048c1a00>: Failed to establish a new connection: [Errno 8] nodename nor servname provided, or not known')': /simple/pandas/
ERROR: Could not find a version that satisfies the requirement pandas (from versions: none)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: pip3 install --upgrade pip
ERROR: No matching distribution found for pandas

In [5]:
!pip3 install pandas

Collecting pandas
  Downloading pandas-2.2.3-cp312-cp312-macosx_11_0_arm64.whl.metadata (89 kB)
Requirement already satisfied: numpy>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2025.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2025.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Downloading pandas-2.2.3-cp312-cp312-macosx_11_0_arm64.whl (11.4 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 11.4/11.4 MB 20.9 MB/s eta 0:00:001m24.9 MB/s eta 0:00:01
Downloading pytz-2025.2-py2.py3-none-any.whl (509 kB)
Downloading tzdata-2025.2-py2.py3-none-any.whl (347 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2025.2 tzdata-2025.2

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: pip3 install --upgrade pip

In [7]:
!pip3 install --upgrade pandas

Requirement already satisfied: pandas in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /Library/Frameworks/Python.framework/Versions/3.12/lib/python3.12/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

[notice] A new release of pip is available: 24.3.1 -> 25.0.1
[notice] To update, run: pip3 install --upgrade pip

#Pandas
    pip install pandas 
    pip install --upgrade pandas
    Pandas Series
    Pandas DataFrame --> use various ways to initialize it(dtype,columns,index)
    shape
    head
    tail
    convert to numpy array --> values
    columns
    to_csv (index = false)
    read_csv
    drop(columns=[])
    describe()
    info()
    iloc
    loc
    Access Particular Columns
    indexing and slicing --> multirow and col
    columns.get_loc
    Fancy indexing
    Filtering
    unique
    sort_values(by,ascending)
    getdummies
    groupby --> column name, various functions on grp, iterate
    pivot --> summarize and aggregate data,Grouper
    concat--> give as list, ignore_index,join
    merge--> on,how
    dropna
    fillna
    interpolate
pip install matplotlib

Pandas
pip install pandas 
pip install --upgrade pandas
Pandas Series
Pandas DataFrame --> use various ways to initialize it(dtype,columns,index)
shape
head
tail
convert to numpy array --> values
columns
to_csv (index = false)
read_csv
drop(columns=[])
describe()
info()
iloc
loc
Access Particular Columns
indexing and slicing --> multirow and col
columns.get_loc
Fancy indexing
Filtering
unique
sort_values(by,ascending)
getdummies
groupby --> column name, various functions on grp, iterate
pivot --> summarize and aggregate data,Grouper
concat--> give as list, ignore_index,join
merge--> on,how
dropna
fillna
interpolate
pip install matplotlib

In [8]:
import pandas as pd
import numpy as np

In [9]:
print(pd.__version__)

2.2.3

In [14]:
l1=np.array([10,20,30,40,50])
d1={'A':20,'B':100,'C':10}

In [16]:
# pds=pd.Series(l1,index = ['A','B','C','D','E'],dtype='f8')
pds = pd.Series(d1)

In [17]:
pds

A     20
B    100
C     10
dtype: int64

In [71]:
marks = {
    'phy':[85,95,62,74,33],
    'maths':[98,79,94,75,54],
    'chem':[23,95,90,88,71]
}

In [72]:
marks

{'phy': [85, 95, 62, 74, 33],
 'maths': [98, 79, 94, 75, 54],
 'chem': [23, 95, 90, 88, 71]}

In [27]:
df=pd.DataFrame(marks,index=['A','B','C','D','E'],columns=['phy','maths'])

In [28]:
df

   phy  maths
A   85     98
B   95     79
C   62     94
D   74     75
E   33     54

In [73]:
na = np.random.randint(1,101,size=(10,3))

In [74]:
na

array([[28, 90, 74],
       [ 3, 99, 20],
       [82, 84, 31],
       [35, 49, 83],
       [48, 35, 77],
       [31, 66, 72],
       [11, 76, 54],
       [98, 60, 75],
       [ 1, 77, 20],
       [32, 73, 74]])

In [75]:
df2=pd.DataFrame(na,columns=['Physics','Chemistry','Mathematics'])

In [76]:
df2['SST'] = np.random.randint(1,101,size=(10,))

In [77]:
df2

   Physics  Chemistry  Mathematics  SST
0       28         90           74   57
1        3         99           20   69
2       82         84           31   46
3       35         49           83   80
4       48         35           77   13
5       31         66           72    7
6       11         76           54   57
7       98         60           75   89
8        1         77           20   79
9       32         73           74   69

In [38]:
df2.shape

(10, 4)

In [41]:
df2.head(3)

   Physics  Chemistry  Mathematics  SST
0       98         22           32   16
1       31         41           97   32
2       66         21           62   16

In [42]:
df2.tail(3)

   Physics  Chemistry  Mathematics  SST
7       82         31            8   73
8        6         18            6   53
9       62          5           96   71

In [43]:
df2.values

array([[98, 22, 32, 16],
       [31, 41, 97, 32],
       [66, 21, 62, 16],
       [45, 58, 36, 41],
       [33,  1, 31, 61],
       [88, 87, 94, 41],
       [17, 26, 18, 24],
       [82, 31,  8, 73],
       [ 6, 18,  6, 53],
       [62,  5, 96, 71]])

In [45]:
df2.to_csv("Marks.csv" ,sep='|')

In [46]:
df2.astype('f8')

   Physics  Chemistry  Mathematics   SST
0     98.0       22.0         32.0  16.0
1     31.0       41.0         97.0  32.0
2     66.0       21.0         62.0  16.0
3     45.0       58.0         36.0  41.0
4     33.0        1.0         31.0  61.0
5     88.0       87.0         94.0  41.0
6     17.0       26.0         18.0  24.0
7     82.0       31.0          8.0  73.0
8      6.0       18.0          6.0  53.0
9     62.0        5.0         96.0  71.0

In [49]:
df2.drop(columns=['Chemistry'],inplace=True)

In [51]:
df2.drop(index=[0,1])

   Physics  Mathematics  SST
2       66           62   16
3       45           36   41
4       33           31   61
5       88           94   41
6       17           18   24
7       82            8   73
8        6            6   53
9       62           96   71

In [52]:
df2.describe()

         Physics  Mathematics        SST
count  10.000000    10.000000  10.000000
mean   52.800000    48.000000  42.800000
std    31.258066    36.469165  21.227864
min     6.000000     6.000000  16.000000
25%    31.500000    21.250000  26.000000
50%    53.500000    34.000000  41.000000
75%    78.000000    86.000000  59.000000
max    98.000000    97.000000  73.000000

In [53]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Physics      10 non-null     int64
 1   Mathematics  10 non-null     int64
 2   SST          10 non-null     int64
dtypes: int64(3)
memory usage: 372.0 bytes

In [54]:
df2['Physics']

0    98
1    31
2    66
3    45
4    33
5    88
6    17
7    82
8     6
9    62
Name: Physics, dtype: int64

In [55]:
df2[['Physics','SST']]

   Physics  SST
0       98   16
1       31   32
2       66   16
3       45   41
4       33   61
5       88   41
6       17   24
7       82   73
8        6   53
9       62   71

In [56]:
df2.loc[0,'Physics']

np.int64(98)

In [57]:
df2.loc[0]

Physics        98
Mathematics    32
SST            16
Name: 0, dtype: int64

In [59]:
df2.loc[[0,1,2,3],'Physics']

0    98
1    31
2    66
3    45
Name: Physics, dtype: int64

In [60]:
df.iloc[0,1]

np.int64(98)

In [61]:
df2

   Physics  Mathematics  SST
0       98           32   16
1       31           97   32
2       66           62   16
3       45           36   41
4       33           31   61
5       88           94   41
6       17           18   24
7       82            8   73
8        6            6   53
9       62           96   71

In [85]:
df2.iloc[2:6,1:3]

   Chemistry  Mathematics
2         84           31
3         49           83
4         35           77
5         66           72

In [87]:
df2.loc[2:5,'Chemistry':'Mathematics']

   Chemistry  Mathematics
2         84           31
3         49           83
4         35           77
5         66           72

In [88]:
df2

   Physics  Chemistry  Mathematics  SST
0       28         90           74   57
1        3         99           20   69
2       82         84           31   46
3       35         49           83   80
4       48         35           77   13
5       31         66           72    7
6       11         76           54   57
7       98         60           75   89
8        1         77           20   79
9       32         73           74   69

In [90]:
df2[df2['Physics']>80]

   Physics  Chemistry  Mathematics  SST
2       82         84           31   46
7       98         60           75   89

In [92]:
df3=pd.read_csv("weather_data_cities.csv")

In [93]:
df3

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [105]:
hot_days=df3[[['city']=='Mumbai'] and df3['temperature']>=90]

In [106]:
hot_days['day']

4    1/1/2017
7    1/4/2017
Name: day, dtype: object

In [107]:
df3.loc[(df3['city'] == 'paris') & (df3['temperature'] == 50), 'temperature'] = 91

In [108]:
df3

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           91         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [109]:
hot_days=df3[[['city']=='Mumbai'] and df3['temperature']>=90]

In [110]:
hot_days['day']

4    1/1/2017
7    1/4/2017
9    1/2/2017
Name: day, dtype: object

In [112]:
df2['Chemistry'].apply(lambda x:x**2)

0    8100
1    9801
2    7056
3    2401
4    1225
5    4356
6    5776
7    3600
8    5929
9    5329
Name: Chemistry, dtype: int64

In [119]:
pdd=pd.get_dummies(pds)

In [120]:
pdd

     10     20     100
A  False   True  False
B  False  False   True
C   True  False  False

In [121]:
gdf = df3.groupby(by='city')

In [123]:
for city,group in gdf:
    print(city)
    print(group)
    print()

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           91         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy